/*
*********************************************************************************************************
*	                                  
*	模块名称 : 摄像头
*	文件名称 : App_Camera.c
*	版    本 : V1.2
*	说    明 : 摄像头
*	修改记录 :
*		版本号    日期          作者         说明
*		v1.0    2013-04-26    Eric2013      首发
*       v1.1    2014-05-23    Eric2013      1. 更改主界面同时支持4.3寸，5寸和7寸屏的显示
*       v1.2    2014-07-19    Eric2013      1. 配合主界面实现快速的背景刷新
*	
*	Copyright (C), 2014-2015, 安富莱电子 www.armfly.com
*
*********************************************************************************************************
*/
#include "includes.h"
#include "MainTask.h"


/*
*********************************************************************************************************
*	函 数 名: OnICON6Clicked
*	功能说明: 主函数 
*	形    参：pMsg
*	返 回 值: 无
*********************************************************************************************************
*/
void OnICON6Clicked(void)
{ 	
    CPU_BOOLEAN SemFlag;

    bsp_InitCamera();
    RA8875_StartDirectDraw(10, 10, 240, 320);
	CAM_Start(RA8875_GetDispMemAddr());
                                        	
	while(1)
	{					 				  
        SemFlag = BSP_OS_SemWait(&SEM_OV7670, 0);
		if(SemFlag == DEF_OK)
		{
            CAM_Stop();
			RA8875_QuitDirectDraw();
            break; 
        }				
	}
	
}

/***************************** 安富莱电子 www.armfly.com (END OF FILE) *********************************/
