/*
*********************************************************************************************************
*
*	模块名称 : lwip client
*	文件名称 : lwip_client.h
*	版    本 : V1.0
*	说    明 : LwIP 客户端
*	修改记录 :
*		版本号    日期          作者         说明
*		v1.0    2017-08-30    Tupelo Shen    首发
*	
*	Copyright (C), 2017-2027, 迭迩塔智控 www.delta.com
*
*********************************************************************************************************
*/
#ifndef __LWIP_CLIENT_H__
#define __LWIP_CLIENT_H__

/*
 *******************************************************************************************************
 *                                          INCLUDES
 *******************************************************************************************************
 */
#include "stm32f4xx.h"
/*
 *******************************************************************************************************
 *                                          MACRO DEF
 *******************************************************************************************************
 */
#define TCP_CLIENT_RX_BUFSIZE	2000	//接收缓冲区长度
#define REMOTE_PORT				8087	//定义远端主机的IP地址
#define LWIP_SEND_DATA			0X80    //定义有数据发送
#define MAC_SIZE				6u
#define IP_SIZE					4u
#define DATA_RCV_LEN_DEFAULT 	512u
#define DATA_SEND_LEN_DEFAULT 	50u
#define DATA_HEADER_LEN			(4+MAC_SIZE+IP_SIZE+1+2+4)
#define CRC_SIZE				4u
#define TAIL_SIZE				4u
/*
 *******************************************************************************************************
 *                                          ENUM DEF
 *******************************************************************************************************
 */
//tcp服务器连接状态
enum tcp_client_states
{
	ES_TCPCLIENT_NONE = 0,		//没有连接
	ES_TCPCLIENT_CONNECTED,		//连接到服务器了 
	ES_TCPCLIENT_CLOSING,		//关闭连接
};
/*
 *******************************************************************************************************
 *                                          STRUCT DEF
 *******************************************************************************************************
 */
/*
 * lwip控制结构体
 */
typedef struct  
{
	u8 mac[6];      //MAC地址
	u8 remoteip[4];	//远端主机IP地址 
	u8 ip[4];       //本机IP地址
	u8 netmask[4]; 	//子网掩码
	u8 gateway[4]; 	//默认网关的IP地址
	
	vu8 dhcpstatus;	//dhcp状态 
					//0,未获取DHCP地址;
					//1,进入DHCP获取状态
					//2,成功获取DHCP地址
					//0XFF,获取失败.
}stLwipDev;
/*
 *******************************************************************************************************
 *                                          VAR DEF
 *******************************************************************************************************
 */
extern u8 tcp_client_recvbuf[TCP_CLIENT_RX_BUFSIZE];	//TCP客户端接收数据缓冲区
extern u8 tcp_client_flag;		                        //TCP客户端数据发送标志位

/********************************************************************************************************
 *                                          FUNC DEFINITION
 ********************************************************************************************************/
err_t LwipClientConnect(void);
err_t LwipClientReconnect(void);

#endif

/***************************** 迭迩塔智控 www.delta.com (END OF FILE) *********************************/
